src/Documents/ОтчетыОбОшибках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтчетыОбОшибках</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скриншот</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АнализОшибок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь1С</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи1С</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформацияОтчета</Name>
					<Comment>SD-47816</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеОтветственным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ошибки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Стек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метаданные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ОтчетыОбОшибках/Ext/ObjectModule.bsl
Процедура ЗаполнитьОшибкуНаСервере() Экспорт
	
	МОшибки = Новый Массив;
	МСтек = Новый Массив;  
	Пользователь1С = Неопределено;
	ДополнительнаяИнформацияОтчета = "";
	Документы.ОтчетыОбОшибках.ЗаполнитьОшибку(ТекстОтчета, МОшибки, МСтек, Пользователь1С, ДополнительнаяИнформацияОтчета);
	
	//<< Danilin.V 21.11.2023 SD-49029
	Если не ПустаяСтрока(ДополнительнаяИнформацияОтчета) Тогда 
		ИБ = Справочники.ЗД_ИнформационныеБазы.ВернутьИБ(ДополнительнаяИнформацияОтчета);	
	КонецЕсли;	
	//Danilin.V>>
	
	Ошибки.Очистить();
	Стек.Очистить();
	Для Каждого Эл Из МОшибки Цикл 
		Если Эл[0] <> "" Тогда
			НСтр = Ошибки.Добавить();
			НСтр.Описание = Эл[0];
			Если ТипЗнч(Эл[1])=Тип("Массив") Тогда
				НСтр.Ошибка = МассивВСтроку(Эл[1]);
			Иначе
				НСтр.Ошибка = Эл[1]; 
			КонецЕсли;
			Если Нстр.НомерСтроки = 1 Тогда
				Ошибка = ПолучитьСсылкуНаОшибку(НСтр.Описание);	
			КонецЕсли;
        КонецЕсли;
	КонецЦикла;
	Для Каждого Эл Из МСтек Цикл
		НСтр = Стек.Добавить();
		НСтр.Метаданные = Эл[0];
		НСтр.NСтроки = Эл[1];
		НСтр.Содержание = Эл[2];
		Если Нстр.НомерСтроки = 1 Тогда
			Метаданные = ПолучитьСсылкуНаЭлемент(НСтр.Метаданные);	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

Функция МассивВСтроку(М)
	Рез = "";
	Для Каждого Эл Из М Цикл
		Рез = Эл + Символы.ПС;
	КонецЦикла;
	Возврат Рез;
КонецФункции

Функция ПолучитьСсылкуНаЭлемент(СтрокаМетаданных)
	Рез = Справочники.ЭлементКонфигурации.ПустаяСсылка();
	МассивЭК = СтрРазделить(СтрокаМетаданных,".",Ложь);
	Значение = МассивЭК[1];
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементКонфигурации.Наименование КАК Наименование,
		|	ЭлементКонфигурации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементКонфигурации КАК ЭлементКонфигурации
		|ГДЕ
		|	ЭлементКонфигурации.Наименование ПОДОБНО &Значение
		|ORDER BY 1";
	
	Запрос.УстановитьПараметр("Значение", "%\"+Значение+"\%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	БылоСоответствий = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденоСоответствий = 0;
		Для Каждого Эл Из МассивЭК Цикл
			Если  СтрНайти(ВыборкаДетальныеЗаписи.Наименование,"\" + Эл) > 0 Тогда
				НайденоСоответствий = НайденоСоответствий + 1;	
			КонецЕсли;
		КонецЦикла;
		Если НайденоСоответствий > БылоСоответствий Тогда
			БылоСоответствий = НайденоСоответствий;
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции    

Функция ПолучитьСсылкуНаОшибку(СтрокаОписания)
	Рез = Справочники.АнализОшибок.ПустаяСсылка();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнализОшибок.Наименование КАК Наименование,
		|	АнализОшибок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АнализОшибок КАК АнализОшибок
		|ГДЕ
		|	ВЫРАЗИТЬ(АнализОшибок.ТекстОшибки КАК СТРОКА(1024)) = &Значение";  // //<< замена из наименования Danilin.V 11 октября 2023 г. 13:21:31   
	
	Запрос.УстановитьПараметр("Значение", СтрокаОписания);
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда
		Эл = Справочники.АнализОшибок.СоздатьЭлемент();	
		Эл.Наименование = СтрокаОписания;
		Эл.ТекстОшибки = СтрокаОписания;
		
		Эл.Записать();
		Рез = Эл.Ссылка;
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции


Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Справочники.АнализОшибок.РегистрацияОтветственных(Ошибка,Ответственный, ОтветственныйАналитик);
	КонецЕсли;
	
	
КонецПроцедуры
